Table of Contents
 Class AnchorGrid
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Data of the anchor grid
public class AnchorGrid : BoltGrid
Inheritance
object
BoltGrid
AnchorGrid
Inherited Members
 BoltGrid.BoltAssemblyRef
 BoltGrid.Id
 BoltGrid.IsAnchor
 BoltGrid.AnchorLen
 BoltGrid.HoleDiameter
 BoltGrid.Diameter
 BoltGrid.HeadDiameter
 BoltGrid.DiagonalHeadDiameter
 BoltGrid.HeadHeight
 BoltGrid.BoreHole
 BoltGrid.TensileStressArea
 BoltGrid.NutThickness
 BoltGrid.BoltAssemblyName
 BoltGrid.Standard
 BoltGrid.Material
 BoltGrid.Origin
 BoltGrid.AxisX
 BoltGrid.AxisY
 BoltGrid.AxisZ
 BoltGrid.Positions
 BoltGrid.ConnectedPlates
 BoltGrid.ConnectedPartIds
 BoltGrid.ShearInThread
 BoltGrid.BoltInteraction
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 AnchorType
Anchor Type - washer
public AnchorType AnchorType { get; set; }
Property Value
AnchorType
 ConcreteBlock
Data of concrete block
public ConcreteBlock ConcreteBlock { get; set; }
Property Value
ConcreteBlock
 WasherSize
Washer Size used if AnchorType is washer
public double WasherSize { get; set; }
Property Value
double
 Edit this page